llm/benchmark_results/20251028_113904/structured_json/results_json.txt
INFO 10-28 04:45:21 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='https://dotieuthien--example-vllm-openai-compatible-serve.modal.run', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset='json', json_schema_path=None, max_concurrency=None, model='Qwen/Qwen2.5-VL-7B-Instruct-AWQ', tokenizer=None, tokenizer_mode='auto', num_prompts=100, output_len=128, request_rate=10.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_results=False, profile=False, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, no_structured_output=False, structured_output_ratio=1.0)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  31.97     
Total input tokens:                      12200     
Total generated tokens:                  12800     
Request throughput (req/s):              3.13      
Output token throughput (tok/s):         400.35    
Total Token throughput (tok/s):          781.93    
---------------Time to First Token----------------
Mean TTFT (ms):                          6616.51   
Median TTFT (ms):                        5947.05   
P99 TTFT (ms):                           17286.95  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          35.94     
Median TPOT (ms):                        36.57     
P99 TPOT (ms):                           42.00     
---------------Inter-token Latency----------------
Mean ITL (ms):                           36.46     
Median ITL (ms):                         0.01      
P99 ITL (ms):                            359.70    
==================================================
correct_rate(%) 100.0 



=== STDERR ===

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:04<06:41,  4.06s/it]
  2%|▏         | 2/100 [00:04<02:54,  1.78s/it]
  4%|▍         | 4/100 [00:04<01:15,  1.27it/s]
  6%|▌         | 6/100 [00:04<00:44,  2.10it/s]
  9%|▉         | 9/100 [00:05<00:24,  3.69it/s]
 10%|█         | 10/100 [00:05<00:31,  2.90it/s]
 11%|█         | 11/100 [00:06<00:28,  3.08it/s]
 13%|█▎        | 13/100 [00:06<00:21,  4.00it/s]
 14%|█▍        | 14/100 [00:07<00:31,  2.77it/s]
 15%|█▌        | 15/100 [00:07<00:34,  2.46it/s]
 16%|█▌        | 16/100 [00:07<00:33,  2.54it/s]
 18%|█▊        | 18/100 [00:08<00:25,  3.19it/s]
 22%|██▏       | 22/100 [00:08<00:14,  5.54it/s]
 24%|██▍       | 24/100 [00:09<00:14,  5.37it/s]
 27%|██▋       | 27/100 [00:09<00:12,  6.00it/s]
 28%|██▊       | 28/100 [00:09<00:13,  5.24it/s]
 31%|███       | 31/100 [00:09<00:09,  7.48it/s]
 33%|███▎      | 33/100 [00:10<00:09,  7.18it/s]
 35%|███▌      | 35/100 [00:10<00:07,  8.46it/s]
 37%|███▋      | 37/100 [00:10<00:07,  8.72it/s]
 39%|███▉      | 39/100 [00:10<00:08,  7.04it/s]
 40%|████      | 40/100 [00:11<00:12,  4.63it/s]
 41%|████      | 41/100 [00:11<00:15,  3.78it/s]
 42%|████▏     | 42/100 [00:12<00:17,  3.39it/s]
 43%|████▎     | 43/100 [00:13<00:32,  1.77it/s]
 44%|████▍     | 44/100 [00:14<00:27,  2.07it/s]
 45%|████▌     | 45/100 [00:14<00:21,  2.58it/s]
 46%|████▌     | 46/100 [00:14<00:21,  2.50it/s]
 47%|████▋     | 47/100 [00:14<00:17,  3.09it/s]
 48%|████▊     | 48/100 [00:15<00:28,  1.84it/s]
 49%|████▉     | 49/100 [00:16<00:26,  1.93it/s]
 51%|█████     | 51/100 [00:16<00:15,  3.17it/s]
 53%|█████▎    | 53/100 [00:16<00:10,  4.69it/s]
 55%|█████▌    | 55/100 [00:16<00:08,  5.34it/s]
 57%|█████▋    | 57/100 [00:17<00:06,  6.47it/s]
 58%|█████▊    | 58/100 [00:17<00:07,  5.26it/s]
 59%|█████▉    | 59/100 [00:17<00:08,  4.70it/s]
 60%|██████    | 60/100 [00:17<00:08,  4.67it/s]
 61%|██████    | 61/100 [00:18<00:10,  3.72it/s]
 62%|██████▏   | 62/100 [00:19<00:16,  2.36it/s]
 63%|██████▎   | 63/100 [00:19<00:13,  2.80it/s]
 64%|██████▍   | 64/100 [00:19<00:14,  2.45it/s]
 65%|██████▌   | 65/100 [00:19<00:11,  3.09it/s]
 67%|██████▋   | 67/100 [00:20<00:07,  4.49it/s]
 69%|██████▉   | 69/100 [00:20<00:09,  3.38it/s]
 70%|███████   | 70/100 [00:21<00:11,  2.57it/s]
 71%|███████   | 71/100 [00:22<00:10,  2.74it/s]
 72%|███████▏  | 72/100 [00:22<00:10,  2.72it/s]
 74%|███████▍  | 74/100 [00:22<00:08,  3.01it/s]
 75%|███████▌  | 75/100 [00:23<00:09,  2.59it/s]
 77%|███████▋  | 77/100 [00:24<00:10,  2.29it/s]
 78%|███████▊  | 78/100 [00:25<00:10,  2.04it/s]
 79%|███████▉  | 79/100 [00:25<00:10,  2.05it/s]
 81%|████████  | 81/100 [00:26<00:06,  2.77it/s]
 82%|████████▏ | 82/100 [00:26<00:05,  3.00it/s]
 83%|████████▎ | 83/100 [00:26<00:06,  2.66it/s]
 84%|████████▍ | 84/100 [00:27<00:07,  2.11it/s]
 85%|████████▌ | 85/100 [00:28<00:07,  2.09it/s]
 86%|████████▌ | 86/100 [00:28<00:05,  2.52it/s]
 88%|████████▊ | 88/100 [00:28<00:03,  3.33it/s]
 89%|████████▉ | 89/100 [00:29<00:03,  2.90it/s]
 92%|█████████▏| 92/100 [00:29<00:01,  4.30it/s]
 93%|█████████▎| 93/100 [00:29<00:01,  4.39it/s]
 94%|█████████▍| 94/100 [00:29<00:01,  4.62it/s]
 95%|█████████▌| 95/100 [00:30<00:01,  3.32it/s]
 96%|█████████▌| 96/100 [00:30<00:01,  3.07it/s]
 98%|█████████▊| 98/100 [00:31<00:00,  2.79it/s]
100%|██████████| 100/100 [00:31<00:00,  3.42it/s]
100%|██████████| 100/100 [00:31<00:00,  3.13it/s]